system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

// Coordinate in metri (Tunnel proporzionato a un oggetto di 12.7mm)
xmin -0.03;
xmax  0.08;
ymin -0.03;
ymax  0.03;
zmin -0.1;
zmax -0.05;

// Celle iniziali 
xcells 64;
ycells 32;
zcells 45;

vertices        
(
    ($xmin  $ymin  $zmin) // 0
    ($xmax  $ymin  $zmin) // 1
    ($xmax  $ymax  $zmin) // 2
    ($xmin  $ymax  $zmin) // 3
    ($xmin  $ymin  $zmax) // 4
    ($xmax  $ymin  $zmax) // 5
    ($xmax  $ymax  $zmax) // 6
    ($xmin  $ymax  $zmax) // 7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges           ();

boundary        
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((2 6 5 1));
    }
    walls
    {
        type wall; // Usiamo wall invece di symmetryPlane per sicurezza
        faces 
        (
            (1 5 4 0) // bottom
            (3 7 6 2) // top
            (0 3 2 1) // back
            (4 5 6 7) // front
        );
    }
);

mergePatchPairs ();